# GetAncillaryGroup Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetAncillaryGroup Method
FabricationConfiguration Class See Also
---
Gets the fabrication ancillary group of the specified fabrication ancillary identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public string GetAncillaryGroup(
	int ancillaryId
)
```

Visual Basic
---
```text
Public Function GetAncillaryGroup ( _
	ancillaryId As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetAncillaryGroup(
	int ancillaryId
)
```

# ### Parameters
ancillaryId
    Type: System..::..Int32 The fabrication ancillary database identifier of the ancillary.
# ### Return Value
The group name of the ancillary.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The ancillary does not exist. |

# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace